_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_MSP_НастройкаСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранитьНастройкиВEXCEL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьEXCEL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоНаименованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоДополнительнымРеквизитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаMSPНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеСтатусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_MSP_СтатусыВыгрузкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_MSP_СтатусыВыгрузкиДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_MSP_СтатусыВыгрузкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_MSP_СтатусыВыгрузкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_MSP_СтатусыВыгрузкиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененПослеВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_РазделЛокальнойСметы</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСметы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируетРаздел</Name>
					<Comment>Корректируемый раздел</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОснЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПолнСтоимРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЗарплатеМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_РазделыЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНРТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСПТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет таблицу соответствия проектов/задач/ресурсов сметным данным.
//
// Параметры:
//		Данные 			- Структура - структура переданных данных.
// 		АдресХранилища 	- Строка - Адрес во временном хранилище. 
//
Процедура ЗаполнитьСерверВФоне(Данные, АдресХранилища) Экспорт
	
	ВРДерево = Данные.ВРДерево; 
	ТЗ = Данные.ТЗ;
	ТЗСопоставлений=Данные.ТЗСопоставлений;
	МассивЗначений=Данные.МассивЗначений;
	СинхронизироватьПоДополнительнымРеквизитам=Данные.СинхронизироватьПоДополнительнымРеквизитам;
	ОбСтроительства=Данные.ОбСтроительства;
	СоответствиеКолонокДопРеквизитов=Данные.СоответствиеКолонокДопРеквизитов;
	НаименованиеПроекта=Данные.НаименованиеПроекта;
	
	ДлительныеОперации.СообщитьПрогресс(20);
	ЗаполнитьТаблицыПоДаннымНастройки(ТЗСопоставлений,Данные.Настройки,СоответствиеКолонокДопРеквизитов);
	
	ДлительныеОперации.СообщитьПрогресс(25);
	СформироватьДеревоСметСервер(ВРДерево,Данные.Смета,СинхронизироватьПоДополнительнымРеквизитам,СоответствиеКолонокДопРеквизитов);
	
	Если МассивЗначений<>Неопределено Тогда
		Для Каждого Эл Из МассивЗначений Цикл
			Если Эл.НомерРодителя=0 Тогда
				СтрокаТЗ=ТЗ.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ,Эл);
			Иначе
				СтрокиДерева=ТЗ.Строки.НайтиСтроки(Новый Структура("НомерДляСопоставления",Эл.НомерРодителя),Истина);
				Если СтрокиДерева.Количество()>0 Тогда
					СтрокаТЗ=СтрокиДерева[0].Строки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ,Эл);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(40);
	
	СтрокиПроекта=ТЗ.Строки.НайтиСтроки(Новый Структура("MSP_ВидОбъекта","Ресурс"),Истина);
	СтруктураПоиска=Новый Структура;
	СтруктураПоиска.Вставить("Ресурс","");
	СтруктураПоиска.Вставить("Задача","");
	СтруктураПоиска.Вставить("Проект",НаименованиеПроекта);
	СтруктураПоиска.Вставить("ОбъектСтроительства",ОбСтроительства);
	СтруктураПоискаПоСоответствию=новый Структура;
	//СтруктураПоискаПоСоответствию.Вставить("Наименование","");
	СтруктураПоискаПоСоответствию.Вставить("Шифр","");
	Если СинхронизироватьПоДополнительнымРеквизитам ТОгда
		Для Каждого Кол Из СоответствиеКолонокДопРеквизитов Цикл
			Если Кол.Используется Тогда
				СтруктураПоиска.Вставить("П"+Кол.ИмяКолонки,"");
				СтруктураПоискаПоСоответствию.Вставить("Д"+Кол.ИмяКолонки,"");
			Конецесли;
		КонецЦикла;
	Конецесли;	
	
	СтруктураПоискаПоСоответствию.Вставить("ВСоответствии",Ложь);
	
	ВРСоотв=ТЗСопоставлений.Скопировать();
	СтрокиСоответствия=Новый Массив;
	Прогресс=40; СчетчикПрогресса=0;
	КоэфСтрок=50/СтрокиПроекта.Количество();
	Для Каждого Эл Из  СтрокиПроекта Цикл
		СчетчикПрогресса=СчетчикПрогресса+1;
		ДлительныеОперации.СообщитьПрогресс(40+СчетчикПрогресса*КоэфСтрок);	
		Для НомерПрохода=1 По 3 Цикл
			Прогресс=Прогресс+10;
			
			Если НомерПрохода =2 Тогда
				СтруктураПоиска.Вставить("Проект","");
				СтруктураПоиска.Вставить("ОбъектСтроительства","");
				Для Каждого ЭлДляУдаления Из  СтрокиСоответствия Цикл
					ВРСоотв.Удалить(ЭлДляУдаления);
				КонецЦикла;
				
			ИначеЕсли НомерПрохода =3 Тогда
				СтруктураПоиска.Удалить("Проект");
				СтруктураПоиска.Удалить("ОбъектСтроительства");
				Для Каждого ЭлДляУдаления Из  СтрокиСоответствия Цикл
					ВРСоотв.Удалить(ЭлДляУдаления);
				КонецЦикла;
				
			КонецЕсли;
			
			СтруктураПоиска.Ресурс=Эл.MSP_НаименованиеОбъекта;
			СтруктураПоиска.Задача=Эл.Родитель.MSP_НаименованиеОбъекта;
			Если СинхронизироватьПоДополнительнымРеквизитам Тогда
				Для Каждого Кол Из СоответствиеКолонокДопРеквизитов Цикл
					если Кол.Используется Тогда
						СтруктураПоиска["П"+Кол.ИмяКолонки]=Эл[Кол.ИмяКолонки];
						СтруктураПоискаПоСоответствию["Д"+Кол.ИмяКолонки]=Эл[Кол.ИмяКолонки];
					Конецесли;
				КонецЦикла;
			Конецесли;
			
			СтрокиСоответствия=ВРСоотв.НайтиСтроки(СтруктураПоиска);
			Для Каждого ЭлСоотв Из  СтрокиСоответствия Цикл
				
				//СтруктураПоискаПоСоответствию.Наименование=ЭлСоотв.Работа;
				СтруктураПоискаПоСоответствию.Шифр=ЭлСоотв.КодРаботы;
				СтрокиСметы=ВРДерево.Строки.НайтиСтроки(СтруктураПоискаПоСоответствию,Истина);
				Для Каждого СтрокаСметы Из СтрокиСметы Цикл
					Если  Строка(СтрокаСметы.ТипНормативногоСборника)=СокрЛП(ЭлСоотв.ТипНормативногоСборника) Тогда
						СтрокаСметы.ВСоответствии=Истина;
						Эл.ВСоответствии=Истина;
						СтрокаСметы.НомерВПроекте=Эл.НомерДляСопоставления;
						Эл.ОбъемДляВыгрузки=Эл.ОбъемДляВыгрузки+СтрокаСметы.Объем;
						Эл.ОбъемСметы=Эл.ОбъемДляВыгрузки;
						Эл.Действие="Замещать";
						Эл.ЕдиницаСметы=СтрокаСметы.ЕдиницаИзмеренияРесурса+".";
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	СтрокиСметы=ВРДерево.Строки.НайтиСтроки(Новый Структура("ВСоответствии",Ложь),Истина);
	Для Каждого СтрокаСметы Из СтрокиСметы Цикл
		СтрокаСметы.ПоказыватьВНесопоставленных=Истина;
		РодительСтроки=СтрокаСметы.Родитель;
		Пока РодительСтроки<>Неопределено Цикл
			РодительСтроки.ПоказыватьВНесопоставленных=Истина;	
			РодительСтроки=РодительСтроки.Родитель;
		КонецЦикла;	
		Если Не СтрокаСметы.ЕстьВложенныеЗадачи Тогда
			СтрокаСметы.КомментСсылка="Открыть";
		КонецЕсли;	
	КонецЦикла;
	
	СтрокиПроекта=ТЗ.Строки.НайтиСтроки(Новый Структура("Действие",""),Истина);
	Для Каждого СтрокаПроекта Из СтрокиПроекта Цикл
		СтрокаПроекта.Действие="Не изменять";
		Если  СтрокаПроекта.MSP_ВидОбъекта="Ресурс" Тогда
			СтрокаПроекта.ПоказыватьВНесопоставленных=Истина;
			РодительСтроки=СтрокаПроекта.Родитель;
			Пока РодительСтроки<>Неопределено Цикл
				РодительСтроки.ПоказыватьВНесопоставленных=Истина;	
				РодительСтроки=РодительСтроки.Родитель;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
	Структура = Новый Структура("ВРДерево,ТЗ,ТЗСопоставлений",ВРДерево,ТЗ,ТЗСопоставлений);
	АдресХранилища = ПоместитьВоВременноеХранилище(Структура, АдресХранилища);
	
КонецПроцедуры

// Процедура заполняет таблицу соответствия проектов/задач/ресурсов сметным данным.
//
// Параметры:
//		Данные 			- Структура - структура переданных данных.
// 		АдресХранилища 	- Строка - Адрес во временном хранилище. 
//
Процедура ЗаполнитьСерверВФонеСопоставление(Данные, АдресХранилища) Экспорт

	ВРДерево = Данные.ВРДерево; 
	ТЗ = Данные.ТЗ;
	ТЗСоотв=Данные.ТЗСоотв;
	ТЗСопоставлений=Данные.ТЗСопоставлений;
	МассивЗначения=Данные.МассивЗначений;
	ОбСтроительства=Данные.ОбСтроительства;
	СинхронизироватьПоДополнительнымРеквизитам=Данные.СинхронизироватьПоДополнительнымРеквизитам;
	СоответствиеКолонокДопРеквизитов=Данные.СоответствиеКолонокДопРеквизитов;	
	НаименованиеПроекта=Данные.НаименованиеПроекта;
	
	СформироватьДеревоСметСерверСопоставление(ВРДерево);
	ТЗ.Строки.Очистить();	
	ДлительныеОперации.СообщитьПрогресс(10);
	Если  МассивЗначения<>Неопределено Тогда
		Для Каждого Эл Из МассивЗначения Цикл
			Если Эл.НомерРодителя=0 Тогда
				СтрокаТЗ=ТЗ.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ,Эл);
			Иначе
				СтрокиДерева=ТЗ.Строки.НайтиСтроки(Новый Структура("НомерДляСопоставления",Эл.НомерРодителя),Истина);
				Если СтрокиДерева.Количество()>0 Тогда
					СтрокаТЗ=СтрокиДерева[0].Строки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ,Эл);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	ДлительныеОперации.СообщитьПрогресс(20);
	СтрокиПроекта=ТЗ.Строки.НайтиСтроки(Новый Структура("MSP_ВидОбъекта","Ресурс"),Истина);
	СтруктураПоиска=Новый Структура;
	СтруктураПоиска.Вставить("Ресурс","");
	СтруктураПоиска.Вставить("Задача","");
	СтруктураПоиска.Вставить("Проект",НаименованиеПроекта);
	СтруктураПоиска.Вставить("ОбъектСтроительства",ОбСтроительства);
	Если СинхронизироватьПоДополнительнымРеквизитам ТОгда
		Для Каждого Кол Из СоответствиеКолонокДопРеквизитов Цикл
			Если Кол.Используется тогда
			СтруктураПоиска.Вставить("П"+Кол.ИмяКолонки,"");
			Конецесли;
		КонецЦикла;
	Конецесли;	
	
	СтруктураПоискаПоСоответствию=новый Структура;
	СтруктураПоискаПоСоответствию.Вставить("Наименование","");
	СтруктураПоискаПоСоответствию.Вставить("Шифр","");
	СтруктураПоискаПоСоответствию.Вставить("ВСоответствии",Ложь);
	
	ВРСоотв=ТЗСопоставлений.Скопировать();
	СтрокиСоответствия=Новый Массив;
	СчетчикПрогресса=0;
	КоэфСтрок=80/СтрокиПроекта.Количество();
	
	Для Каждого Эл Из  СтрокиПроекта Цикл
		СчетчикПрогресса=СчетчикПрогресса+1;
		ДлительныеОперации.СообщитьПрогресс(20+СчетчикПрогресса*КоэфСтрок);	
		
		Для НомерПрохода=1 По 3 Цикл
			Если НомерПрохода =2 Тогда
				СтруктураПоиска.Вставить("Проект","");
				СтруктураПоиска.Вставить("ОбъектСтроительства","");
				Для Каждого ЭлДляУдаления Из  СтрокиСоответствия Цикл
					ВРСоотв.Удалить(ЭлДляУдаления);
				КонецЦикла;
				
			ИначеЕсли НомерПрохода =3 Тогда
				СтруктураПоиска.Удалить("Проект");
				СтруктураПоиска.Удалить("ОбъектСтроительства");
				Для Каждого ЭлДляУдаления Из  СтрокиСоответствия Цикл
					ВРСоотв.Удалить(ЭлДляУдаления);
				КонецЦикла;
				
			КонецЕсли;
			
			СтруктураПоиска.Ресурс=Эл.MSP_НаименованиеОбъекта;
			СтруктураПоиска.Задача=Эл.Родитель.MSP_НаименованиеОбъекта;
			Если СинхронизироватьПоДополнительнымРеквизитам Тогда
				Для Каждого Кол Из СоответствиеКолонокДопРеквизитов Цикл
					Если Кол.Используется тогда
					СтруктураПоиска["П"+Кол.ИмяКолонки]=Эл[Кол.ИмяКолонки];
					КонецЕсли;
				КонецЦикла;
			Конецесли;
			
			СтрокиСоответствия=ВРСоотв.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ЭлСоотв Из  СтрокиСоответствия Цикл
				
				СтруктураПоискаПоСоответствию.Наименование=ЭлСоотв.Работа;
				СтруктураПоискаПоСоответствию.Шифр=ЭлСоотв.КодРаботы;
				
				
				СтрокиСметы=ВРДерево.Строки.НайтиСтроки(СтруктураПоискаПоСоответствию,Истина);
				Для Каждого СтрокаСметы Из СтрокиСметы Цикл
					Если  Строка(СтрокаСметы.ТипНормативногоСборника)=СокрЛП(ЭлСоотв.ТипНормативногоСборника) Тогда
						СтрокаСметы.ВСоответствии=Истина;
						Эл.ВСоответствии=Истина;
						СтрСоотв=ТЗСоотв.Добавить();
						СтрСоотв.НомерВПроекте=Эл.НомерДляСопоставления;
						СтрСоотв.НомерВНС=СтрокаСметы.НомерДляСопоставления;
						СтрСоотв.НомерСтрокиСопоставления=ЭлСоотв.Номер;
					КонецЕсли;
				КонецЦикла;
				
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	Структура = Новый Структура("ВРДерево,ТЗ,ТЗСопоставлений,ТЗСоотв",ВРДерево,ТЗ,ТЗСопоставлений,ТЗСоотв);
	АдресХранилища = ПоместитьВоВременноеХранилище(Структура, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДеревоСметСервер(ВРДерево,Смета,СинхронизироватьПоДополнительнымРеквизитам = Истина,СоответствиеКолонокДопРеквизитов)
	
	Т1=""; Т2="";
	Запрос=Новый Запрос;
	Если   СинхронизироватьПоДополнительнымРеквизитам Тогда
		Набор=Справочники.НаборыДополнительныхРеквизитовИСведений["Документ_СМ_ПозицияЛокальнойСметы"];
		Ном=1;
		
		Для Каждого Рекв Из Набор.ДополнительныеРеквизиты Цикл
			ИмяКолонки="Колонка"+СтрЗаменить(Ном,Символы.НПП,"");
			Т1=Т1+",Т"+ИмяКолонки+".Значение КАК Д"+ИмяКолонки;
			Т2=Т2+" ЛЕВОЕ СОЕДИНЕНИЕ ВТДоп КАК Т"+ИмяКолонки+" ПО 
			|ВТ.Ссылка=Т"+ИмяКолонки+".Ссылка  И Т"+ИмяКолонки+".Свойство=&Д"+ИмяКолонки;
			Запрос.УстановитьПараметр("Д"+ИмяКолонки,Рекв.Свойство);
			Ном=Ном+1;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_ЛокальнаяСмета.Ссылка
	|ПОМЕСТИТЬ ЛокальныеСметы
	|ИЗ
	|	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	|ГДЕ
	|	СМ_ЛокальнаяСмета.Ссылка В (&Смета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_РазделЛокальнойСметы.Ссылка
	|ПОМЕСТИТЬ Разделы
	|ИЗ
	|	Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЛокальныеСметы КАК ЛокальныеСметы
	|		ПО СМ_РазделЛокальнойСметы.ИДСметы = ЛокальныеСметы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СМ_ПозицияЛокальнойСметы.Ссылка,
	|	СМ_ПозицияЛокальнойСметы.ИДРодителя,
	|	СМ_ПозицияЛокальнойСметы.ИДСметы,
	|	СМ_ПозицияЛокальнойСметы.ЕдиницаИзмерения,
	|	СМ_ПозицияЛокальнойСметы.ОбъемРабот,
	|	СМ_ПозицияЛокальнойСметы.ШифрРасценки КАК Шифр,
	|	СМ_ПозицияЛокальнойСметы.ТипНормативныхСборников,СМ_ПозицияЛокальнойСметы.ПорНомер,
	|	ЕСТЬNULL(СМ_MSP_СтатусыВыгрузкиДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СМ_MSP_СтатусыВыгрузкиДокументов.НеВыгружен)) КАК Статус
	|ПОМЕСТИТЬ ВТПозиции
	|ИЗ
	|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЛокальныеСметы КАК ЛокальныеСметы
	|		ПО СМ_ПозицияЛокальнойСметы.ИДСметы = ЛокальныеСметы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_MSP_СтатусыВыгрузкиДокументов КАК СМ_MSP_СтатусыВыгрузкиДокументов
	|		ПО (СМ_MSP_СтатусыВыгрузкиДокументов.Документ = СМ_ПозицияЛокальнойСметы.Ссылка)
	|ГДЕ
	|	НЕ СМ_ПозицияЛокальнойСметы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Ссылка,
	|	СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Свойство,
	|	СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Значение
	|ПОМЕСТИТЬ ВТДоп
	|ИЗ
	|	Документ.СМ_ПозицияЛокальнойСметы.ДополнительныеРеквизиты КАК СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПозиции КАК ВТПозиции
	|		ПО СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Ссылка = ВТПозиции.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Ссылка,
	|	СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Свойство,
	|	СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Значение
	|ИЗ
	|	Документ.СМ_РазделЛокальнойСметы.ДополнительныеРеквизиты КАК СМ_РазделЛокальнойСметыДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Разделы КАК Разделы
	|		ПО СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Ссылка = Разделы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_ЛокальнаяСметаДополнительныеРеквизиты.Ссылка,
	|	СМ_ЛокальнаяСметаДополнительныеРеквизиты.Свойство,
	|	СМ_ЛокальнаяСметаДополнительныеРеквизиты.Значение
	|ИЗ
	|	Документ.СМ_ЛокальнаяСмета.ДополнительныеРеквизиты КАК СМ_ЛокальнаяСметаДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЛокальныеСметы КАК ЛокальныеСметы
	|		ПО СМ_ЛокальнаяСметаДополнительныеРеквизиты.Ссылка = ЛокальныеСметы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СМ_РазделЛокальнойСметы.Ссылка,
	|	СМ_РазделЛокальнойСметы.ИДРодителя,
	|	ВЫРАЗИТЬ(СМ_РазделЛокальнойСметы.Ссылка.НаименованиеДляПечати КАК СТРОКА(500)) КАК Наименование,
	|	""Раздел"" КАК ВидОбъекта,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияРесурса,
	|	0 КАК Объем,
	|	"""" КАК Шифр,
	|	ЗНАЧЕНИЕ(Перечисление.СМ_ТипыНормативныхСборников.ПустаяСсылка) КАК ТипНормативногоСборника,
	|	ЗНАЧЕНИЕ(Перечисление.СМ_MSP_СтатусыВыгрузкиДокументов.ПустаяСсылка) КАК Статус,
	|СМ_РазделЛокальнойСметы.ПорНомер
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Разделы КАК Разделы
	|		ПО Разделы.Ссылка = Разделы.Ссылка
	| 
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПозиции.Ссылка,
	|	ВТПозиции.ИДРодителя,
	|	ВЫРАЗИТЬ(ВТПозиции.Ссылка.Наименование КАК СТРОКА(500)),
	|	""Позиция"",
	|	ВТПозиции.ЕдиницаИзмерения,
	|	ВТПозиции.ОбъемРабот,
	|	ВТПозиции.Шифр,
	|	ВТПозиции.ТипНормативныхСборников,
	|	ВТПозиции.Статус,ПорНомер
	|ИЗ
	|	ВТПозиции КАК ВТПозиции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛокальныеСметы.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(ЛокальныеСметы.Ссылка.Наименование КАК СТРОКА(500)),
	|	""Смета"",
	|	"""",
	|	0,
	|	"""",
	|	ЗНАЧЕНИЕ(Перечисление.СМ_ТипыНормативныхСборников.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.СМ_MSP_СтатусыВыгрузкиДокументов.ПустаяСсылка),0
	|ИЗ
	|	ЛокальныеСметы КАК ЛокальныеСметы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка,
	|	ВТ.ИДРодителя,
	|	ВТ.Наименование,
	|	ВТ.ВидОбъекта,
	|	ВТ.ТипНормативногоСборника,
	|	ВТ.Шифр,
	|	ВТ.ЕдиницаИзмеренияРесурса,
	|	ВТ.Статус,
	|	ВТ.Объем "+Т1+"
	|ИЗ
	|	ВТ КАК ВТ " +Т2 +" УПОРЯДОЧИТЬ По ПорНомер";
	Запрос.УстановитьПараметр("Смета",Смета);
	Результат=Запрос.Выполнить().Выгрузить();	
	
	
	
	ВРДерево.Строки.Очистить();
	Номер=1;
	ЗаполнитьДерево(ВРДерево,Результат,Неопределено,Номер,СинхронизироватьПоДополнительнымРеквизитам,СоответствиеКолонокДопРеквизитов);	
	
	
	
КонецПроцедуры

Процедура ЗаполнитьДерево(ВДерево, ВТаблица, ТабРодитель = Неопределено,Номер,СинхронизироватьПоДополнительнымРеквизитам,СоответствиеКолонокДопРеквизитов)
	Строки = ВТаблица.НайтиСтроки(Новый Структура("ИДРодителя", ТабРодитель));
	Для Каждого Стр Из Строки Цикл
		НоваяСтрока = ВДерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		
		Если СинхронизироватьПоДополнительнымРеквизитам ТОгда
			Для Каждого Кол Из СоответствиеКолонокДопРеквизитов Цикл
				Если Кол.Используется Тогда
					Если  НоваяСтрока["Д"+Кол.ИмяКолонки]="" Тогда
						Если  ВДерево<>Неопределено И ТипЗнч(ВДерево)<>Тип("ДеревоЗначений") Тогда
							НоваяСтрока["Д"+Кол.ИмяКолонки]=ВДерево["Д"+Кол.ИмяКолонки];
						КонецЕсли;
					КонецЕсли;
				Конецесли;
			КонецЦикла;
		КонецЕсли;	
		
		НоваяСтрока.НомерДляСопоставления=Номер;
		Если ТипЗнч(ВДерево)<>Тип("ДеревоЗначений") Тогда 
			
			ВДерево.ЕстьВложенныеЗадачи=Истина;
		КонецЕсли;
		
		Номер=Номер+1;                          
		ЗаполнитьДерево(НоваяСтрока, ВТаблица, Стр.Ссылка,Номер,СинхронизироватьПоДополнительнымРеквизитам,СоответствиеКолонокДопРеквизитов);
	КонецЦикла;
КонецПроцедуры

Функция ЗаполнитьТаблицыПоДаннымНастройки(ТаблицаСопоставлений,Настройки,СоответствиеКолонокДопРеквизитов)
	
	Область=Настройки.НайтиТекст("Проект");
	Если Область=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ИмяЯчейки     = Область.Имя;
	ДлинаИмени     = СтрДлина(ИмяЯчейки);
	ПозицияС     = Найти(ИмяЯчейки,"C");
	СтрокаЗаголовка     = Сред(ИмяЯчейки, 2, ПозицияС-2);
	ПерваяКолонка     = Сред(ИмяЯчейки, ПозицияС+1, ДлинаИмени-ПозицияС);
	
	Область=Настройки.НайтиТекст("Тип нормативного сборника");
	Если Область<>Неопределено Тогда
		ИмяЯчейки     = Область.Имя;
		ДлинаИмени     = СтрДлина(ИмяЯчейки);
		ПозицияС     = Найти(ИмяЯчейки,"C");
		ПоследняяКолонка     =Сред(ИмяЯчейки, ПозицияС+1, ДлинаИмени-ПозицияС);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Настройки.Область(СтрокаЗаголовка, ПерваяКолонка, Настройки.ВысотаТаблицы, ПоследняяКолонка));
	Построитель.Выполнить();
	ТЗ = Построитель.Результат.Выгрузить();	
	ТаблицаСопоставлений.Очистить();
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если Колонка.Имя="НаименованиеРаботы" Тогда Колонка.Имя="Работа"; 
		ИначеЕсли Колонка.Имя="НаименованиеРесурса" Тогда Колонка.Имя="РесурсСметы";
		ИначеЕсли Колонка.Имя="НазваниеЗадачи" Тогда Колонка.Имя="Задача";
		ИначеЕсли Колонка.Имя="РесурсПроекта" Тогда Колонка.Имя="Ресурс";	
		ИначеЕсли Колонка.Имя="ПлановыйОбъём_Всего" Тогда Колонка.Имя="ОбъемСметы";	
		ИначеЕсли Колонка.Имя="Трудозатраты" Тогда Колонка.Имя="ОбъемПроекта";
		Иначе 
			ТЗС=ТаблицаСопоставлений;
			Если ТЗС.Колонки.Найти(Колонка.Имя)=Неопределено Тогда
				ИмяДляПоиска=Колонка.Имя;
				Преф="П";
				СтрМас=СоответствиеКолонокДопРеквизитов.НайтиСтроки(Новый Структура("Заголовок",ИмяДляПоиска));
				Если СтрМас.Количество()>0 Тогда
					Колонка.Имя=Преф+СтрМас[0].ИмяКолонки;
				Конецесли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Эл Из ТЗ Цикл
		Стр=ТаблицаСопоставлений.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Эл);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура СформироватьДеревоСметСерверСопоставление(ВРДерево)
	
	Запрос=новый Запрос("ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка,
	|	СМ_НормативныеСборники.Наименование,
	|	СМ_НормативныеСборники.КодНормативнойРасценки КАК Шифр,
	|	СМ_НормативныеСборники.ТипНормативногоСборника,
	|	СМ_НормативныеСборники.Родитель КАК ИДРодителя,
	|	СМ_НормативныеСборники.ЕдиницаИзмерения КАК ЕдиницаИзмеренияРесурса,
	|	0 КАК Объем,
	|	""Задача"" КАК ВидОбъекта
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|ГДЕ
	|	НЕ СМ_НормативныеСборники.ПометкаУдаления
	|");
	
	
	Результат=Запрос.Выполнить().Выгрузить();	
	
	ВРДерево.Строки.Очистить();
	Номер=1;
	ЗаполнитьДеревоСопоставление(ВРДерево,Результат,Справочники.СМ_НормативныеСборники.ПустаяСсылка(),Номер);	
	
	
	
КонецПроцедуры

Процедура ЗаполнитьДеревоСопоставление(ВДерево, ВТаблица, ТабРодитель = Неопределено,Номер)
	Строки = ВТаблица.НайтиСтроки(Новый Структура("ИДРодителя", ТабРодитель));
	Для Каждого Стр Из Строки Цикл
		НоваяСтрока = ВДерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		НоваяСтрока.НомерДляСопоставления=Номер;
		Если ТипЗнч(ВДерево)<>Тип("ДеревоЗначений") И Стр.ВидОбъекта="Задача" Тогда
			ВДерево.ЕстьВложенныеЗадачи=Истина;
		КонецЕсли;
		Номер=Номер+1;                          
		ЗаполнитьДеревоСопоставление(НоваяСтрока, ВТаблица, Стр.Ссылка,Номер);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
